# IExtElemChangeBeamSection Interface

---
Interface Change Beam section functionality to be implemented in add-ins
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

    public interface IExtElemChangeBeamSection

    Public Interface IExtElemChangeBeamSection

    public interface class IExtElemChangeBeamSection

    type IExtElemChangeBeamSection = interface end
The IExtElemChangeBeamSection type exposes the following members.
| Name| Description
---|---|---
| ChangeSection|  The method that will be called when user wants to change beam section
Top
#### Reference
Autodesk.Revit.DB.Structure Namespace